mdhardenburgh/Blinky/Packages/.cache/NXP.MKE15Z7_DFP.12.0.0.pdsc
    <condition id="device.MKE15Z7_AND_component.lpuart_adapter_AND_component.serial_manager_uart_AND_device.MKE15Z7_startup_AND_driver.adc12_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.lpi2c_AND_driver.lpuart_AND_driver.port_AND_driver.smc_AND_utility.debug_console">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MKE15Z7_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="adc"/>
    </condition>
    <condition id="device.MKE15Z7_AND_driver.dmamux_AND_driver.edma">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.MKE15Z7_AND_driver.common">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKE15Z7_AND_driver.common_AND_driver.lpuart">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="device.MKE15Z7_AND_component.lists_AND_driver.common">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.MKE15Z7_AND_driver.lpuart">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="device.MKE15Z7_AND_CMSIS_Include_core_cm0plus">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="device.MKE15Z7_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.lpi2c_edma">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKE15Z7_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.lpspi_edma">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKE15Z7_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.lpuart_edma">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKE15Z7_AND_device.MKE15Z7_CMSIS_AND_driver.clock">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MKE15Z7_startup"/>
    </condition>
    <condition id="device.MKE15Z7_AND_driver.common_AND_driver.dmamux">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKE15Z7_AND_driver.flexio">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
    </condition>
    <condition id="device.MKE15Z7_AND_driver.edma_AND_driver.flexio_spi">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
    </condition>
    <condition id="device.MKE15Z7_AND_driver.edma_AND_driver.flexio_uart">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MKE15Z7_AND_driver.edma_AND_driver.lpi2c">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
