mdhardenburgh/Blinky/Packages/.cache/NXP.MKE15Z7_DFP.12.0.0.pdsc
    <condition id="device.MKE15Z7_AND_driver.edma_AND_driver.lpspi">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
    </condition>
    <condition id="device.MKE15Z7_AND_driver.edma_AND_driver.lpuart">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="device.MKE15Z7_AND_utility.debug_console">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MKE15Z7_AND_component.serial_manager_AND_driver.common">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKE15Z7_AND_component.lists_AND_driver.common_AND_utility.debug_console">
      <accept Dname="MKE15Z256???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE15Z128???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKE15Z7" Cversion="1.0.0" condition="device.MKE15Z7_AND_component.lpuart_adapter_AND_component.serial_manager_uart_AND_device.MKE15Z7_startup_AND_driver.adc12_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.lpi2c_AND_driver.lpuart_AND_driver.port_AND_driver.smc_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.MKE15Z7_AND_driver.dmamux_AND_driver.edma">
      <description/>
      <files>
        <file category="header" attr="config" name="template/RTE_Device.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="device.MKE15Z7_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/lists/generic_list.c"/>
        <file category="header" name="components/lists/generic_list.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter" Cversion="1.0.0" condition="device.MKE15Z7_AND_driver.common_AND_driver.lpuart">
      <description/>
      <files>
        <file category="sourceC" name="components/uart/lpuart_adapter.c"/>
        <file category="header" name="components/uart/uart.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.0" condition="device.MKE15Z7_AND_component.lists_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_manager.c"/>
        <file category="header" name="components/serial_manager/serial_manager.h"/>
        <file category="header" name="components/serial_manager/serial_port_internal.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="device.MKE15Z7_AND_driver.lpuart">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_port_uart.c"/>
        <file category="header" name="components/serial_manager/serial_port_uart.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MKE15Z7_startup" Cversion="1.0.0" condition="device.MKE15Z7_AND_CMSIS_Include_core_cm0plus">
      <description/>
      <files>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MKE15Z7.s"/>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MKE15Z7.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKE15Z128xxx7_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKE15Z128xxx7_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKE15Z256xxx7_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKE15Z256xxx7_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKE15Z128xxx7_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKE15Z128xxx7_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKE15Z256xxx7_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKE15Z256xxx7_ram.icf"/>
        <file category="header" attr="config" name="MKE15Z7.h"/>
        <file category="header" attr="config" name="MKE15Z7_features.h"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="sourceC" attr="config" name="system_MKE15Z7.c"/>
        <file category="header" attr="config" name="system_MKE15Z7.h"/>
      </files>
    </component>
